api/app/controllers/api/appointments_controller.rb

  def index
    @appointments = current_user.appointments
    render json: @appointments.map { |apt| format_appointment(apt) }, status: :ok
---
SELECT "appointments".* FROM "appointments" WHERE "appointments"."user_id" = 3

  def create
    appointment_data = appointment_params.to_h
    appointment_data['patient_name'] = appointment_data.delete('doctorName')

    # Combine date and time into appointment_date
    date = appointment_data.delete('date')
    time = appointment_data.delete('time')
    appointment_data['appointment_date'] = "#{date} #{time}" if date && time

    @appointment = current_user.appointments.build(appointment_data)
    if @appointment.save
---
INSERT INTO "appointments" ("appointment_date", "created_at", "patient_name", "reason", "updated_at", "user_id") VALUES ('2026-01-29 07:00:00', '2026-01-29 19:24:32.397186', 'Dorothy jebet', 'consultation', '2026-01-29 19:24:32.397186', 4) RETURNING "id"

  def destroy
    if @appointment.destroy
---
DELETE FROM "appointments" WHERE "appointments"."id" = 4