api/app/controllers/api/auth_controller.rb

  def signup
    user = User.new(user_params)
    if user.save
---
INSERT INTO "users" ("created_at", "email", "name", "password_digest", "updated_at", "role", "password_reset_token", "password_reset_sent_at") VALUES ('2026-01-29 19:15:41.698683', 'dorothykimeli@gmail.com', 'Dorothy Jebet Kimeli', '$2a$12$fevwIP913TQkGc..aOiqzuCbDCLodTptaHI/1vKtujoG6ySnZ.3AK', '2026-01-29 19:15:41.698683', 'user', NULL, NULL) RETURNING "id"

  def login
    user = User.find_by(email: params[:user][:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = 'dorothykimeli@gmail.com' LIMIT 1