api/app/controllers/appointments_controller.rb

  def create
    appointment = current_user.appointments.create(appointment_params)
---
INSERT INTO "appointments" ("appointment_date", "created_at", "patient_name", "reason", "updated_at", "user_id") VALUES ('2026-02-01 14:00:00', '2026-01-29 17:04:02.447302', 'Jane Smith', 'Consultation', '2026-01-29 17:04:02.447302', 1) RETURNING "id"

  def show
    appointment = current_user.appointments.find_by(id: params[:id])
---
SELECT "appointments".* FROM "appointments" WHERE "appointments"."user_id" = 1 AND "appointments"."id" = 1 LIMIT 1

  def update
    appointment = current_user.appointments.find_by(id: params[:id])
    if appointment&.update(appointment_params)
---
SELECT "appointments".* FROM "appointments" WHERE "appointments"."user_id" = 1 AND "appointments"."id" = 1 LIMIT 1
UPDATE "appointments" SET "reason" = 'Follow-up consultation', "updated_at" = '2026-01-29 17:06:12.278685' WHERE "appointments"."id" = 1

  def destroy
    appointment = current_user.appointments.find_by(id: params[:id])
    if appointment
      appointment.destroy
---
SELECT "appointments".* FROM "appointments" WHERE "appointments"."user_id" = 1 AND "appointments"."id" = 1 LIMIT 1
DELETE FROM "appointments" WHERE "appointments"."id" = 1