api/app/controllers/appointments_controller.rb

SELECT "appointments".* FROM "appointments"
---
  def index
    @appointments = current_user.appointments
    render json: @appointments.map { |apt| format_appointment(apt) }, status: :ok