api/app/controllers/auth_controller.rb

INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at") VALUES ('Donaldkk Kipchumba', 'donaa@gmail.com', '$2a$12$C4JwtamrG/KjN2XQDMweJ.qaSHl.l1DedMR3ubBIZOzJR2b7nxntO', '2026-01-28 18:49:12.536516', '2026-01-28 18:49:12.536516') RETURNING "id"
---
  def signup
    user = User.new(user_params)
    if user.save